---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportDGNSettings
source: html/9d9aa903-2633-7b65-eebe-71a702609d5c.htm
---
# ExportDGNSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.